info/apdl-config.org
#+bind: org-html-preamble-format (("en" "%d"))
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:{} arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not "LOGBOOK") date:t
#+OPTIONS: e:t email:t f:t inline:t num:t p:nil pri:nil prop:nil
#+OPTIONS: stat:t tags:t tasks:t tex:t timestamp:t toc:1 todo:t |:t
#+AUTHOR: H. Dieter Wilhelm
#+EMAIL: dieter@duenenhof-wilhelm.de
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+OPTIONS: html-link-use-abs-url:nil html-postamble:t html-preamble:t
#+OPTIONS: html-scripts:t html-style:t html5-fancy:nil tex:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+HTML_LINK_HOME: https://github.com/dieter-wilhelm/apdl-mode
#+HTML_LINK_UP: ../index.html
#+HTML_HEAD:
#+HTML_HEAD_EXTRA:
#+HTML_MATHJAX:
#+INFOJS_OPT:
#+LATEX_HEADER:
# #+TITLE: Configuration and Customisation of APDL-Mode
#+text: Copyright (C) 2016 - 2025, H. Dieter Wilhelm, GPL V3

#+cindex: Configuration
#+cindex: Configure APDL-Mode
#+cindex: Customisation
#+cindex: Customise APDL-Mode

Most functionality of APDL-Mode is working without additional
configurations.  APDL-Mode is intelligent enough to figure out Ansys
installation dependent paths.  For regular Ansys installations, it
chooses by default the highest installed Ansys version on your system.

APDL-Mode configures GNU-Emacs to open all files with the suffixes
".mac", ".ans", ".dat" and ".inp" under apdl-mode.  (The latter two
file types might come from Ansys WorkBench input files which are
usually huge program generated files.)

#  So for ".dat" and ".inp" dynamic highlighting of
# variables is not activated

You can change the APDL-Mode configurations permanently by 1. using
the Emacs customisation system
#+texinfo: @inforef{Easy Customization,,emacs}
or 2. by directly manipulating the Emacs configuration file
#+texinfo: @inforef{Init File,,emacs}.


  1. For an overview of available APDL-Mode customisation's variables
     it’s easiest to open the APDL-Mode’s customisation buffer either
     with the command ‘M-x apdl-customise-apdl’ or from the menu bar
     -> ’APDL’ -> ’Customise APDL Mode’ and search for interesting
     options.  Another way of using the customisation facility is to
     open the help of respective variables.  Let’s change for example
     the highlighting level which is stored in the customisation
     variable ‘apdl-highlighting-level’: Open its documentation with
     "C-h v" `apdl-highlighting-level'.  In its help buffer you can
     click on the hyperlink `customize’ at the bottom.  You might set
     a value for this particular variable only for the current session
     or you might add your choices automatically in the Emacs
     configuration file for future sessions.

  2. The following describes editing the Emacs configuration file (for
     example ~/.emacs or ~/.emacs.d/init.el).  These customisations
     are written in `Emacs-Lisp'.  The comment sign in this language
     is ~;~ (one semi-colon `;').

* Conventions
  used in /apdl-config.el/, APDL-Mode's example configuration file.
  Textual hints in /apdl-config.el/ are indicated with TWO semi-colons
  ~;;~, please uncomment only the code lines with a SINGLE comment sign
  and change them when appropriate.

  Please add the interesting code lines into your GNU-Emacs init file
  or load your adjustments of this file with `(load-file
  "PATH/apdl-config.el")' from your init file.

  #+BEGIN_SRC emacs-lisp :tangle yes :exports none
    ;;; apdl-config.el --- Customisation example for APDL-Mode
    ;; This file was built from the file "apdl-config.org".

    ;; Copyright (C) 2016 - 2025 H. Dieter Wilhelm, GPL V3
    ;; Author: H. Dieter Wilhelm <dieter@duenenhof-wilhelm.de>
    ;; Version: 20.7.0
    ;; Package-Requires: ((emacs "25.1"))
    ;; Keywords: languages, convenience, tools, Ansys, APDL
    ;; URL: https://github.com/dieter-wilhelm/apdl-mode

    ;; Maintainer: H. Dieter Wilhelm
    ;; Created: 2006-02

    ;; Parts of this mode were originally base on octave-mod.el: Copyright
    ;; (C) 1997 Free Software Foundation, Inc.  Author: Kurt Hornik
    ;; <Kurt.Hornik@wu-wien.ac.at> Author: John Eaton
    ;; <jwe@bevo.che.wisc.edu>

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; This code is free software; you can redistribute it and/or modify
    ;; it under the terms of the GNU General Public License as published
    ;; by the Free Software Foundation; either version 3, or (at your
    ;; option) any later version.
    ;;
    ;; This lisp script is distributed in the hope that it will be useful,
    ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
    ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
    ;;
    ;; Permission is granted to distribute copies of this lisp script
    ;; provided the copyright notice and this permission are preserved in
    ;; all copies.
    ;;
    ;; You should have received a copy of the GNU General Public License
    ;; along with this program; if not, you can either send email to this
    ;; program's maintainer or write to: The Free Software Foundation,
    ;; Inc.; 675 Massachusetts Avenue; Cambridge, MA 02139, USA.
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    ;;; Commentary:
    ;; The customisations itself are written in `Emacs-Lisp'.
    ;; The comment is ~;~ (one semi-colon `;').  Textual hints
    ;; are indicated with DOUBLE semi-colons `;;', optionally uncomment
    ;; the code lines with a SINGLE comment sign.

    ;; Please add the interesting code lines into your GNU-Emacs init file or
    ;; load this file in the init file with `(load-file
    ;; "PATH/apdl-config.el")'.

    ;;; CODE:
  #+END_SRC

* Important Prerequisite
  For using Ansys processes, like getting license information, the
  Ansys Installation path with version information is necessary.
  APDL-Mode is looking in different places and is using environment
  variables to detect your Ansys installation but if you have a non
  default installation it might not be able to find it.  In that case
  please configure your installation path up to and including the
  Ansys versioning number.

  You can change the installation path for the current session with
  the MAPDL menu entry "Change Installation Directory".

   #+BEGIN_SRC emacs-lisp  :tangle yes
  (cond ((string= window-system "x")
	  ;; This condition is an example of an installation directory on GNU-Linux
	  (setq apdl-ansys-install-directory "/appl/ansys_inc/v201/"))
	  ;; the default might look like "/ansys_inc/v201/"
	 (t ;; The default condition is an example of an installation directory on WINDOWS
	  ;; Emacs is using here forward slashes as under Unix and not the backslash "\"!
	  (setq apdl-ansys-install-directory "D:/Ansys Inc/v201/")))
	  ;; default: "C:/Program Files/Ansys Inc/v201/"
   #+END_SRC

   If your Ansys installation differs completely from the standard
   Ansys directory structure, or if you want to use multiple versions of
   Ansys, then please consult the section [[*Installation dependent configurations][Installation dependent configurations]].

** COMMENT Finding APDL-Mode
   If the APDL-Mode files (the files with the suffix /.el/) are *not*
   placed in a default Emacs load path.  Please see the variable
   load-path .

   #+BEGIN_SRC emacs-lisp
   (describe-variable 'load-path)
   #+END_SRC

   Or you can read about the load-path in the Emacs manual:
   #+BEGIN_SRC emacs-lisp
   (info "(emacs)Lisp Libraries")
   #+END_SRC

   Then it is necessary to adjust the following way: Hint: The
   directory site-lisp/ in the Emacs installation tree, for example,
   is in its default load path.

   #+BEGIN_SRC emacs-lisp
   (add-to-list 'load-path "C:\\DIRECTORY-PATH\\WHERE\\THE\\APDL-MODE\\FILES\\RESIDE")
   #+END_SRC
   for example:
   #+BEGIN_SRC emacs-lisp
   (add-to-list 'load-path "c:\\emacs\\apdl-mode")
   #+END_SRC
   for a Windows system or
   #+BEGIN_SRC emacs-lisp
   (add-to-list 'load-path "/usr/local/src/emacs/apdl-mode")
   #+END_SRC
   for a GNU-Linux system.
* File suffixes
  For auto loading APDL-Mode please customise your file suffixes for
  which Ansys mode is automatically called for.
** Macro files
   /.mac/ is the macro suffix of Ansys i. e. these macro files can be
   called in the Ansys command prompt or APDL like a regular Ansys
   function (without the suffix /.mac/).

   APDL-Mode has configured GNU-Emacs to open files with this suffix
   under apdl-mode.  Please check the /example.mac/ file in the /doc/
   folder.

   With the following setting


  #+BEGIN_SRC emacs-lisp :tangle yes
    (add-to-list 'auto-mode-alist '("\\.apdl$" . apdl-mode))
  #+END_SRC

  files with the suffix /.apdl/ will be opened under APDL-Mode.
** WorkBench generated input files
   /.dat/ and /.inp/ are WorkBench's solver input file suffixes.  See
   the file /example.dat/ in the /doc/ folder.

   APDL-Mode has configured GNU-Emacs to open files with these
   suffixes under apdl-mode.

# #+BEGIN_SRC emacs-lisp
#   (add-to-list 'auto-mode-alist '("\\.dat$" . apdl-mode)) ;
#   (add-to-list 'auto-mode-alist '("\\.inp\\'" . apdl-mode))
# #+END_SRC

