info/apdl-config.md

# Table of Contents

1.  [Conventions](#org89f3845)
2.  [Important Prerequisite](#org05d3fc5)
3.  [File suffixes](#orgd0c5d50)
4.  [Auto insertion](#orgf847457)
5.  [Miscellaneous](#orgf0e56d2)
6.  [Outlining](#org1417193)
7.  [Highlighting (Colourisation)](#orgcafc92b)
8.  [Installation dependent configurations](#orga558e72)
9.  [Ansys processes](#orgb22da1e)

Most functionality of APDL-Mode is working without additional
configurations.  APDL-Mode is intelligent enough to figure out Ansys
installation dependent paths.  For regular Ansys installations, it
chooses by default the highest installed Ansys version on your system.

APDL-Mode configures GNU-Emacs to open all files with the suffixes
".mac", ".dat" and ".inp" under apdl-mode.

You can change the APDL-Mode configurations permanently by 1. using
the Emacs customisation system

or 2. by directly manipulating the Emacs configuration file

1.  For an overview of available APDL-Mode customisation's variables
    it’s easiest to open the APDL-Mode’s customisation buffer either
    with the command ‘M-x apdl-customise-apdl’ or from the menu bar
    -> ’APDL’ -> ’Customise APDL Mode’ and search for interesting
    options.  Another way of using the customisation facility is to
    open the help of respective variables.  Let’s change for example
    the highlighting level which is stored in the customisation
    variable ‘apdl-highlighting-level’: Open its documentation with
    "C-h v" \`apdl-highlighting-level'.  In its help buffer you can
    click on the hyperlink \`customize’ at the bottom.  You might set
    a value for this particular variable only for the current session
    or you might add your choices automatically in the Emacs
    configuration file for future sessions.

2.  The following describes editing the Emacs configuration file (for
    example ~/.emacs or ~/.emacs.d/init.el).  These customisations
    are written in \`Emacs-Lisp'.  The comment sign in this language
    is `;` (one semi-colon \`;').


<a id="org89f3845"></a>

# Conventions

used in *apdl-config.el*, APDL-Mode's example configuration file.
Textual hints in *apdl-config.el* are indicated with TWO semi-colons
`;;`, please uncomment only the code lines with a SINGLE comment sign
and change them when appropriate.

Please add the interesting code lines into your GNU-Emacs init file
or load your adjustments of this file with \`(load-file
"PATH/apdl-config.el")' from your init file.


<a id="org05d3fc5"></a>

# Important Prerequisite

For using Ansys processes, like getting license information, the
Ansys Installation path with version information is necessary.
APDL-Mode is looking in different places and is using environment
variables to detect your Ansys installation but if you have a non
default installation it might not be able to find it.  In that case
please configure your installation path up to and including the
Ansys versioning number.

You can change the installation path for the current session with
the MAPDL menu entry "Change Installation Directory".

    (cond ((string= window-system "x")
    	;; This condition is an example of an installation directory on GNU-Linux
    	(setq apdl-ansys-install-directory "/appl/ansys_inc/v201/"))
    	;; the default might look like "/ansys_inc/v201/"
           (t ;; The default condition is an example of an installation directory on WINDOWS
    	;; Emacs is using here forward slashes as under Unix and not the backslash "\"!
    	(setq apdl-ansys-install-directory "D:/Ansys Inc/v201/")))
    	;; default: "C:/Program Files/Ansys Inc/v201/"

If your Ansys installation differs completely from the standard
Ansys directory structure, or if you want to use multiple versions of
Ansys, then please consult the section [Installation dependent configurations](#orga558e72).


<a id="orgd0c5d50"></a>

# File suffixes

For auto loading APDL-Mode please customise your file suffixes for
which Ansys mode is automatically called for.


## Macro files

*.mac* is the macro suffix of Ansys i. e. these macro files can be
called in the Ansys command prompt or APDL like a regular Ansys
function (without the suffix *.mac*).

APDL-Mode has configured GNU-Emacs to open files with this suffix
under apdl-mode.  Please check the *example.mac* file in the *doc*
folder.

With the following setting

    (add-to-list 'auto-mode-alist '("\\.apdl$" . apdl-mode))

files with the suffix *.apdl* will be opened under APDL-Mode.


## WorkBench generated input files

*.dat* and *.inp* are WorkBench's solver input file suffixes.  See
the file *example.dat* in the *doc* folder.

APDL-Mode has configured GNU-Emacs to open files with these
suffixes under apdl-mode.
