info/apdl-config.md


## The Ansys Neutral file format

*.anf* is the suffix for "Ansys Neutral" files which include mostly
geometric data but also some APDL snippets. These files are used
for imports, see the file *example.anf* in the *doc* folder.

    (add-to-list 'auto-mode-alist '("\\.anf$" . apdl-mode))

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; file suffixes for autoloading of APDL-Mode, appropriate file
    ;; suffixes for which Ansys mode is automatically called for
    
    ;; .mac is the macro suffix of Ansys i. e. these macros can be called
    ;; in the Ansys command prompt like a regular Ansys function (without
    ;; the suffix .mac).  See the file doc/example.mac
    
    ;; APDL-Mode has configured GNU-Emacs to open files with this suffix
    ;; under apdl-mode.
    
    ;; (add-to-list 'auto-mode-alist '("\\.mac$" . apdl-mode))
    (add-to-list 'auto-mode-alist '("\\.ans$" . apdl-mode))
    
    ;; .dat and .inp are WorkBench's solver input file suffixes
    ;; See the file doc/example.dat
    
    ;; APDL-Mode has configured GNU-Emacs to open files with these suffixes
    ;; under apdl-mode.
    
    ;; (add-to-list 'auto-mode-alist '("\\.dat$" . apdl-mode))
    ;; (add-to-list 'auto-mode-alist '("\\.inp\\'" . apdl-mode))
    
    ;; .anf is the suffix for "Ansys Neutral" files which include mostly
    ;;  gometric data but also some APDL snippets. See the file
    ;;  doc/example.anf.
    (add-to-list 'auto-mode-alist '("\\.anf$" . apdl-mode))


<a id="orgf847457"></a>

# Auto insertion

of code.  With the following code block Emacs inserts (after query)
an outline of a code structure when creating a new file with any
suffix in the `auto-mode-alist` for `apdl-mode`, please see above
section).

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    			  ;; Auto insertion
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; auto insertion stuff (when creating a new APDL file)
    
     (auto-insert-mode 1)		        ; insert automatically templates
     (add-hook 'find-file-hook 'auto-insert) ; when opening new files
     (setq auto-insert-query t)   ; aks for auto insertion of APDL template
    
     (add-to-list 'auto-insert-alist
      '(apdl-mode . [apdl-skeleton-outline-template])) ;which template to insert


<a id="orgf0e56d2"></a>

# Miscellaneous

     ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    			   ;; Miscellaneous
     ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    
    ;; use Emacs' EWW browser for locally installed help
    (setq browse-url-browser-function 'eww-browse-url)
    ;; use the default system browser
    ; (setq browse-url-browser-function 'browse-url-default-browser)
    
    ;; Some element collections, like "SHELLS" are implemented with `#'
    ;; anchors which are not standard URLs.  This leads to an error on
    ;; Windows with w32-shell-execute for locally installed help files.
    ;; Browsers don't mind the anchors, so in this case use either EWW
    ;; (see above) or specify an installed browser in your init file, see
    ;; below example for MS Edge:
    
      (defun browse-url-edge (url &optional new-window)
      (shell-command
       (concat "start msedge " url)))
    
      ; (setq browse-url-browser-function 'browse-url-edge)

    ;; The amount of time the help overlay is shown from
    ;; (`apdl-show-command-parameters').
    
    ; (setq apdl-parameter-help-duration 30) ; 30 seconds, the default
    (setq apdl-parameter-help-duration "2 min")
    
    ;; If you want to read the manual in GNU-Emacs' EWW browser.  This
    ;; might only work for locally installed help documents (a 1.7 GB
    ;; package v201) since v191 the online help is the default help
    ;; system.
    
    ;; You might use this variable to create you own templates
    ;; in `apdl-wb-template.el'.
    
    (setq apdl-wb-custom-template-directory "c:/my_macros/") ; new in 20.4.0
    
    ;;  APDL-Mode mode configures the following variable from the
    ;;  evironment to show your license usage in
    ;;  `apdl-user-license-status'.  It is the user ID you are registered
    ;;  for the license server.  This is only necessary if APDL-Mode can't
    ;;  find the environment variable USERNAME.
    
    (setq apdl-username "myUserID") 		; new in 20.4.0


<a id="org1417193"></a>

# Outlining

Activating outline minor mode for selectively hiding and revealing
code sections:

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    			     ;; Outlining
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; activating outline minor mode for selectively hiding/unhiding
    ;; sections
    
    (add-hook 'apdl-mode-hook 'apdl-outline-minor-mode) ;enable outlining


<a id="orgcafc92b"></a>

# Highlighting (Colourisation)


## Dynamic highlighting

of variables.  The following toggles a dynamics change of the
highlighting: While you are editing your new variable definitions
highlighted and the cursor position is shown in the parameter help
overlay

Uncommenting the following might slow the editing of large .mac
files (but only when apdl-highlighting-level is set to 2, see
below).

    (setq apdl-dynamic-highlighting-flag nil)
    ; (setq apdl-dynamic-highlighting-flag t) ;default: t
