info/apdl-config.org
** Summary
#+BEGIN_SRC emacs-lisp :tangle yes
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
		       ;; Highlighting/Colourisation
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  ;; The following toggles a dynamics change of the highlighting: While
  ;; you are editing your new variable definitions highlighted and the
  ;; cursor position is shown in the parameter help overlay

  ;; Uncommenting the following might slow the editing of large .mac,
  ;; .inp or .ans files.

   (setq apdl-dynamic-highlighting-flag nil)
  ; (setq apdl-dynamic-highlighting-flag t) ; default

  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; fontification (highlighting) of user variables and decoration
  ;; levels (0,1,2 are available)

   (setq apdl-highlighting-level 1) ; default: 2

#+END_SRC
* Installation dependent configurations
  Further things you possibly have to configure if your Ansys
  installation is completely differing from a default Ansys installation
  path, or if you want to mix various Ansys versions:

#+BEGIN_SRC emacs-lisp  :tangle yes
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
			   ;; Ansys version and paths
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    ;; Things you might have to configure if your Ansys installation is
    ;; completely differing from default Ansys installation paths, as in
    ;; the example below, especially if you want to use mixed version
    ;; installations of Ansys:

  (setq apdl-ansys-help-program
      "/appl/ansys_inc/20.0.1/v201/commonfiles/help/HelpViewer/AnsysHelpViewer.exe")
      ;; the default under GNU-Linux looks like this:
      ;; "/ansys_inc/v201/commonfiles/help/HelpViewer/AnsysHelpViewer.exe"
  ;; On WINDOWS: slash before /d: is unnecessary, but possible?
  (setq apdl-ansys-help-path "d:/Program Files/Ansys Inc/16.2.0/v201/commonfiles/help/en-us/help/")
  (setq apdl-ansys-help-path "/appl/ansys_inc/16.2.0/v201/commonfiles/help/en-us/help/")
  (setq apdl-ansys-launcher "/appl/ansys_inc/v201/ansys/bin/winx64/launcher")
  (setq apdl-ansys-wb "/appl/ansys_inc/v201/Framework/bin/Linux64/runwb2")
  (setq apdl-ansys-program "/appl/ansys_inc/19.3.0/ansys/bin/ansys195")
  (setq apdl-lmutil-program "/appl/ansys_inc/19.3.0/shared_files/licensing/linx64/lmutil")

#+END_SRC

* COMMENT Extending Emacs load path and initialisation
  redundant with package.el
#+BEGIN_SRC emacs-lisp :tangle yes

;; adding the directory of this (loaded) file to the load-path
(add-to-list 'load-path (file-name-directory load-file-name))
;; setting the APDL-Mode install directory
(setq apdl-mode-install-directory (file-name-directory load-file-name))
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
                              ;; The End
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;; apdl-config.el ends here

;; Local Variables:
;; no-byte-compile: t
;; End:

#+END_SRC

* Ansys processes
** License server
   or license file.

   The more license servers are specified in ~apdl-license-file~ the
   longer it takes to get the license status.

   License server configuration: License servers (or license file
   name) you have to specify also the port for (since Ansys V12.0).
   On GNU-Linux GNU-Linux: License servers are separated by colons
   (":"), on Windows with semicolon ";".  1055 is the default port.

   the following variable APDL-Mode is checking the environment
   variables AnsysLMD_LICENSE_FILE and MD_LICENSE_FILE.

   #+BEGIN_SRC emacs-lisp
     (setq apdl-license-file
       "1055@frlifl01.auto.iwan.com:1055@frlifl02.auto.iwan.com")
   #+END_SRC

   since Ansys 12.0 there is an intermediate server for the communication
   between flexlm and Ansys WorkBench, 2325 is here the default port.
   But the solver/interpreter is checking this server as well!?

   #+BEGIN_SRC emacs-lisp
   (setq apdl-ansysli-servers
      "2325@frlifl01.auto.iwan.com:2325@frlifl02.auto.iwan.com")
   #+END_SRC

** Solver options
   Number of cores for the run: 4 does not require HPC licenses

   #+BEGIN_SRC emacs-lisp
     (setq apdl-no-of-processors 8) ; default: 4, doesn't require HPC licenses
   #+END_SRC

   Which license type to use for the solver

   #+BEGIN_SRC emacs-lisp
     (setq apdl-license "ansys") ; default in APDL-Mode: "preppost"
   #+END_SRC

   The Ansys job name

   #+BEGIN_SRC emacs-lisp
     (setq apdl-job "harmonics1") ; default: "file"
   #+END_SRC

** Summary
#+BEGIN_SRC emacs-lisp :tangle yes
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
                         ;; Ansys processes stuff
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; license server configuration


  ;; GNU-Linux 64 bit only !!! Warning specifiying many license server
  ;; takes a long time for displaying the license status!!!

   ;; for starting the solver & apdl-license-status & Ansys help
  (setq                 ;
   ;; license servers (or license file name)
   ;; specify even the default port for lmutil (since Ansys V 12.0) on GNU-Linux
   ;; GNU-Linux: License servers separated by colons (":"), 1055 is the default port
   apdl-license-file
   "32002@ls_fr_ansyslmd_ww_1.conti.de"

   ;; since Ansys 12.0 there is an intermediate server for
   ;; the communication between flexlm and Ansys, 2325 is the default port
   apdl-ansysli-servers
   "2325@ls_fr_ansyslmd_ww_1.conti.de"
   )

  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
                   ;; options when starting the solver
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  ;; Number of cores for the run, 4 does not require HPC licenses
   (setq apdl-no-of-processors 8) ; default: 4

  ;;  which license type to use for the solver
   (setq apdl-license "preppost") ; default: "ansys"

  ;; Ansys job name
   (setq apdl-job "harmonics1"); default: "file"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
                              ;; The End
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(provide 'apdl-config)

;;; apdl-config.el ends here, the rest are Emacs variables

;; Local Variables:
;; no-byte-compile: t
;; show-trailing-whitespace: t
;; indicate-empty-lines: t
;; End:
#+END_SRC

-----

